chore: switch to mermaid diagram
